30N30P_MultiElement_Airfoil/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        // Name of new patch
        name slat;

        // Dictionary to construct new patch from
        patchInfo
        {
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (slat_upper slat_lower);
    }

    {
        // Name of new patch
        name main;

        // Dictionary to construct new patch from
        patchInfo
        {
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (main_lower1 main_lower2 main_lower3 main_upper);
    }

    {
        // Name of new patch
        name flap;

        // Dictionary to construct new patch from
        patchInfo
        {
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (flap_upper flap_lower, flap_te);
    }

    {
        // Name of new patch
        name sym;

        // Dictionary to construct new patch from
        patchInfo
        {
            type symmetry;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (front back);
    }

    {
        // Name of new patch
        name inout;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        patches (inlet outlet bot top);
    }
);

// ************************************************************************* //

